---
kind: method
id: M:Autodesk.Revit.DB.PrimarySizeCriterion.#ctor(System.Double,System.Double)
source: html/5573317f-946c-a4e2-e525-e065c7fa70cf.htm
---
# Autodesk.Revit.DB.PrimarySizeCriterion.#ctor Method

Constructs a PrimarySizeCriterion with a minimum and maximum size.

## Syntax (C#)
```csharp
public PrimarySizeCriterion(
	double minimumSize,
	double maximumSize
)
```

## Parameters
- **minimumSize** (`System.Double`)
- **maximumSize** (`System.Double`)